#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_backend_service.db-backend will be created
  + resource "google_compute_backend_service" "db-backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "dbbackend"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/databaseig"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }
    }

  # google_compute_backend_service.middleware-backend will be created
  + resource "google_compute_backend_service" "middleware-backend" {
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + fingerprint                     = (known after apply)
      + health_checks                   = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "middlewarebackend"
      + port_name                       = (known after apply)
      + project                         = (known after apply)
      + protocol                        = (known after apply)
      + self_link                       = (known after apply)
      + session_affinity                = (known after apply)
      + timeout_sec                     = (known after apply)

      + backend {
          + balancing_mode  = "UTILIZATION"
          + capacity_scaler = 1
          + group           = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/backendig"
          + max_utilization = 0.8
        }

      + cdn_policy {
          + signed_url_cache_max_age_sec = (known after apply)

          + cache_key_policy {
              + include_host           = (known after apply)
              + include_protocol       = (known after apply)
              + include_query_string   = (known after apply)
              + query_string_blacklist = (known after apply)
              + query_string_whitelist = (known after apply)
            }
        }
    }

  # google_compute_health_check.http-health-check will be created
  + resource "google_compute_health_check" "http-health-check" {
      + check_interval_sec  = 1
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "http-health-check"
      + project             = (known after apply)
      + self_link           = (known after apply)
      + timeout_sec         = 1
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + http_health_check {
          + port         = 80
          + proxy_header = "NONE"
          + request_path = "/"
        }
    }

  # google_compute_health_check.postgresql-hc will be created
  + resource "google_compute_health_check" "postgresql-hc" {
      + check_interval_sec  = 100
      + creation_timestamp  = (known after apply)
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "tcp-health-check"
      + project             = (known after apply)
      + self_link           = (known after apply)
      + timeout_sec         = 100
      + type                = (known after apply)
      + unhealthy_threshold = 2

      + tcp_health_check {
          + port         = 5432
          + proxy_header = "NONE"
        }
    }

  # google_compute_instance.backend_vms[0] will be updated in-place
  ~ resource "google_compute_instance" "backend_vms" {
        can_ip_forward          = false
        cpu_platform            = "Intel Skylake"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm0"
        instance_id             = "6936371167295163867"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "g1-small"
        metadata                = {}
        metadata_fingerprint    = "K8O5oOr2GzQ="
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
        name                    = "backendvm0"
        project                 = "svg-devops-training-2"
        self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm0"
      ~ tags                    = [
          + "backend",
        ]
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "europe-north1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/backendvm0"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
            network_ip         = "10.0.0.9"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork"
            subnetwork_project = "svg-devops-training-2"
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.backend_vms[1] will be updated in-place
  ~ resource "google_compute_instance" "backend_vms" {
        can_ip_forward          = false
        cpu_platform            = "Intel Skylake"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm1"
        instance_id             = "2879450857422966235"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "g1-small"
        metadata                = {}
        metadata_fingerprint    = "K8O5oOr2GzQ="
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
        name                    = "backendvm1"
        project                 = "svg-devops-training-2"
        self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm1"
      ~ tags                    = [
          + "backend",
        ]
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "europe-north1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/backendvm1"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
            network_ip         = "10.0.0.7"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork"
            subnetwork_project = "svg-devops-training-2"
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.backend_vms[2] will be updated in-place
  ~ resource "google_compute_instance" "backend_vms" {
        can_ip_forward          = false
        cpu_platform            = "Intel Skylake"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm2"
        instance_id             = "6855018782992354779"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "g1-small"
        metadata                = {}
        metadata_fingerprint    = "K8O5oOr2GzQ="
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
        name                    = "backendvm2"
        project                 = "svg-devops-training-2"
        self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/backendvm2"
      ~ tags                    = [
          + "backend",
        ]
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "europe-north1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/backendvm2"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
            network_ip         = "10.0.0.8"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork"
            subnetwork_project = "svg-devops-training-2"
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.database_vms[0] will be updated in-place
  ~ resource "google_compute_instance" "database_vms" {
        can_ip_forward          = false
        cpu_platform            = "Intel Skylake"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm0"
        instance_id             = "7653771580654472667"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "g1-small"
        metadata                = {}
        metadata_fingerprint    = "K8O5oOr2GzQ="
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
        name                    = "databasevm0"
        project                 = "svg-devops-training-2"
        self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm0"
      ~ tags                    = [
          + "database",
        ]
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "europe-north1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/databasevm0"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
            network_ip         = "10.0.0.10"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork"
            subnetwork_project = "svg-devops-training-2"
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.database_vms[1] will be updated in-place
  ~ resource "google_compute_instance" "database_vms" {
        can_ip_forward          = false
        cpu_platform            = "Intel Skylake"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm1"
        instance_id             = "8787467231096458715"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "g1-small"
        metadata                = {}
        metadata_fingerprint    = "K8O5oOr2GzQ="
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
        name                    = "databasevm1"
        project                 = "svg-devops-training-2"
        self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm1"
      ~ tags                    = [
          + "database",
        ]
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "europe-north1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/databasevm1"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
            network_ip         = "10.0.0.11"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork"
            subnetwork_project = "svg-devops-training-2"
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.database_vms[2] will be updated in-place
  ~ resource "google_compute_instance" "database_vms" {
        can_ip_forward          = false
        cpu_platform            = "Intel Skylake"
        deletion_protection     = false
        enable_display          = false
        guest_accelerator       = []
        id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm2"
        instance_id             = "3732421136091434459"
        label_fingerprint       = "42WmSpB8rSM="
        labels                  = {}
        machine_type            = "g1-small"
        metadata                = {}
        metadata_fingerprint    = "K8O5oOr2GzQ="
        metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start"
        name                    = "databasevm2"
        project                 = "svg-devops-training-2"
        self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/databasevm2"
      ~ tags                    = [
          + "database",
        ]
        tags_fingerprint        = "42WmSpB8rSM="
        zone                    = "europe-north1-a"

        boot_disk {
            auto_delete = true
            device_name = "persistent-disk-0"
            mode        = "READ_WRITE"
            source      = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/databasevm2"

            initialize_params {
                image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a"
                labels = {}
                size   = 10
                type   = "pd-standard"
            }
        }

        network_interface {
            name               = "nic0"
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
            network_ip         = "10.0.0.6"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork"
            subnetwork_project = "svg-devops-training-2"
        }

        scheduling {
            automatic_restart   = true
            on_host_maintenance = "MIGRATE"
            preemptible         = false
        }
    }

  # google_compute_instance.vm_instance[0] must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm0" -> (known after apply)
      ~ instance_id             = "704195426901020034" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
      ~ metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start" -> "sudo apt get -y update" # forces replacement
      + min_cpu_platform        = (known after apply)
        name                    = "frontendvm0"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm0" -> (known after apply)
      ~ tags                    = [
          + "frontend",
        ]
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/frontendvm0" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.14" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> "test-subnetwork"
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.vm_instance[1] must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm1" -> (known after apply)
      ~ instance_id             = "3391488844043111821" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
      ~ metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start" -> "sudo apt get -y update" # forces replacement
      + min_cpu_platform        = (known after apply)
        name                    = "frontendvm1"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm1" -> (known after apply)
      ~ tags                    = [
          + "frontend",
        ]
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/frontendvm1" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.12" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> "test-subnetwork"
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance.vm_instance[2] must be replaced
-/+ resource "google_compute_instance" "vm_instance" {
        can_ip_forward          = false
      ~ cpu_platform            = "Intel Skylake" -> (known after apply)
        deletion_protection     = false
      - enable_display          = false -> null
      ~ guest_accelerator       = [] -> (known after apply)
      ~ id                      = "projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm2" -> (known after apply)
      ~ instance_id             = "5185648446251715981" -> (known after apply)
      ~ label_fingerprint       = "42WmSpB8rSM=" -> (known after apply)
      - labels                  = {} -> null
        machine_type            = "g1-small"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "K8O5oOr2GzQ=" -> (known after apply)
      ~ metadata_startup_script = "sudo apt get -y update && sudo apt-get -y install nginx && sudo service nginx start" -> "sudo apt get -y update" # forces replacement
      + min_cpu_platform        = (known after apply)
        name                    = "frontendvm2"
      ~ project                 = "svg-devops-training-2" -> (known after apply)
      ~ self_link               = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm2" -> (known after apply)
      ~ tags                    = [
          + "frontend",
        ]
      ~ tags_fingerprint        = "42WmSpB8rSM=" -> (known after apply)
      ~ zone                    = "europe-north1-a" -> (known after apply)

      ~ boot_disk {
            auto_delete                = true
          ~ device_name                = "persistent-disk-0" -> (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
            mode                       = "READ_WRITE"
          ~ source                     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/disks/frontendvm2" -> (known after apply)

          ~ initialize_params {
              ~ image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-1804-bionic-v20200129a" -> "ubuntu-os-cloud/ubuntu-1804-lts"
              ~ labels = {} -> (known after apply)
              ~ size   = 10 -> (known after apply)
              ~ type   = "pd-standard" -> (known after apply)
            }
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
          ~ network_ip         = "10.0.0.13" -> (known after apply)
          ~ subnetwork         = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/regions/europe-north1/subnetworks/test-subnetwork" -> "test-subnetwork"
          ~ subnetwork_project = "svg-devops-training-2" -> (known after apply)
        }

      ~ scheduling {
          ~ automatic_restart   = true -> (known after apply)
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
          ~ preemptible         = false -> (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # google_compute_instance_group.frontendig will be updated in-place
  ~ resource "google_compute_instance_group" "frontendig" {
        description = "frontendig"
        id          = "projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/frontendig"
      ~ instances   = [
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm0",
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm1",
          - "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instances/frontendvm2",
        ] -> (known after apply)
        name        = "frontendig"
        network     = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/global/networks/my-name"
        project     = "svg-devops-training-2"
        self_link   = "https://www.googleapis.com/compute/v1/projects/svg-devops-training-2/zones/europe-north1-a/instanceGroups/frontendig"
        size        = 3
        zone        = "europe-north1-a"

        named_port {
            name = "http"
            port = 8080
        }
        named_port {
            name = "https"
            port = 8443
        }
    }

Plan: 7 to add, 7 to change, 3 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
